app/controllers/cat_rental_requests_controller.rb

SELECT "cats".* FROM "cats"
---
  def new
    @cat_rental_request = CatRentalRequest.new
    @cats = Cat.all

SELECT "cats".* FROM "cats"
INSERT INTO "cat_rental_requests" ("cat_id", "created_at", "end_date", "start_date", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 1], ["created_at", "2014-10-29 23:58:15.366139"], ["end_date", "2014-10-31"], ["start_date", "2014-10-30"], ["updated_at", "2014-10-29 23:58:15.366139"], ["user_id", 2]]
---
  def create
    @cat_rental_request = CatRentalRequest.new(cat_rental_request_params)
    @cats = Cat.all
    @cat_rental_request.user_id = current_user.id
    if @cat_rental_request.save

SELECT  "cat_rental_requests".* FROM "cat_rental_requests"  WHERE "cat_rental_requests"."id" = $1 LIMIT 1  [["id", 12]]
DELETE FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1  [["id", 12]]
---
  def destroy
    @cat_rental_request = CatRentalRequest.find(params[:id])
    user = @cat_rental_request.user
    if user == current_user
      @cat_rental_request.destroy

SELECT  "cats".* FROM "cats"  WHERE "cats"."id" = $1 LIMIT 1  [["id", 1]]
---
  def approve
    @cat_rental_request = current_user.cats_requests.find_by_id(params[:cat_rental_request_id])

SELECT  "cats".* FROM "cats"  WHERE "cats"."id" = $1 LIMIT 1  [["id", 1]]
---
  def deny
    @cat_rental_request = current_user.cats_requests.find_by_id(params[:cat_rental_request_id])