app/controllers/cats_controller.rb

  def show
    @cat = Cat.find(params[:id])
    @requests = @cat.cat_rental_requests.order_by_start_date
---
SELECT  "cats".* FROM "cats"  WHERE "cats"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests"  WHERE "cat_rental_requests"."cat_id" = $1  ORDER BY "cat_rental_requests"."start_date" ASC  [["cat_id", 1]]

  def create
    @cat = Cat.new(cat_params)
    @cat.user_id = current_user.id
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "created_at", "description", "name", "sex", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def edit
    @cat = current_user.cats.find_by_id(params[:id])
---
SELECT  "cats".* FROM "cats"  WHERE "cats"."user_id" = $1 AND "cats"."id" = $2 LIMIT 1  [["user_id", 2], ["id", 1]]

  def destroy
    @cat = current_user.cats.find_by_id(params[:id])
    @cat.destroy unless @cat.nil?
---
SELECT  "cats".* FROM "cats"  WHERE "cats"."user_id" = $1 AND "cats"."id" = $2 LIMIT 1  [["user_id", 2], ["id", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 3]]